app/Http/Controllers/Api/Profile/EquipmentController.php

select * from `cate_gears`
select * from `user_gems` where `user_gems`.`id` in (3) and `user_gems`.`deleted_at` is null
select * from `cate_gears` where `cate_gears`.`id` in (3)
select * from `characters` where `characters`.`id` in (3)
---
    public function __invoke()
    {
        $gears = Auth::user()->gears;
        $cates = CateGear::all();
        $data = [];
        foreach($gears as $key => $gear) {
            foreach($cates as $cate) {
                if($gear->cate_gear_id == $cate->id) {
                    $gear->gems->load(['gems', 'gemItem']);
                    $data[Str::slug($cate->name)][$key] = $gear->load('cates', 'character');

select `gears`.*, `user_gears`.`user_id` as `pivot_user_id`, `user_gears`.`gear_id` as `pivot_gear_id`, `user_gears`.`status` as `pivot_status`, `user_gears`.`id` as `pivot_id` from `gears` inner join `user_gears` on `gears`.`id` = `user_gears`.`gear_id` where `user_gears`.`user_id` = 4
---
    public function available()
    {
        return response()->json(Crypto::encrypt(Auth::user()->gears->where('pivot.status',0)->load('cates','character')));

select * from `user_gears` where (`user_id` = 4 and `status` = 1) and `user_gears`.`deleted_at` is null
select * from `user_gears` where (`user_id` = 4 and `id` = 56 and `gear_id` = 116) and `user_gears`.`deleted_at` is null limit 1
select * from `characters` where `characters`.`id` = 3 and `characters`.`id` is not null limit 1
select * from `gears` where `gears`.`id` in (116)
update `user_gears` set `status` = 1 where `id` = 56
---
    public function use(Request $request)
    {
        $all =  UserGear::with('gear')->where([['user_id',Auth::id()],['status',1]])->get();
        $find = UserGear::where([['user_id',Auth::id()],['id',$request->id],['gear_id',$request->gear_id]])->first();
        if(isset($find) && $find->status == 0)
        {
            if($find->load('gear')->gear->character_id == Auth::user()->character->id)
            {
                if($find->load('gear')->gear->level_required <= Auth::user()->level())
                {
                    foreach($all as $key => $each)
                    {
                        if($each->gear->cate_gear_id == $find->load('gear')->gear->cate_gear_id)
                        {
                            Auth::user()->gears()->updateExistingPivot($each->gear->id,[
                                'status' => 0
                            ],false);
                        }
                    }
                    $wear = UserGear::findOrFail($find->id)->update([
                        'status' => 1
                    ]);
                    if(isset($wear))
                    {
                        $this->updatePower();
                        $response = [
                            'code' => 200,
                            'status' => 'success',
                            'message' => "Đã trang bị ".$find->load('gear')->gear->name." thành công !",
                        ];