app/Http/Controllers/Api/Profile/SkillController.php

select * from `characters` where `characters`.`id` in (3)
select `skills`.*, `user_skills`.`user_id` as `pivot_user_id`, `user_skills`.`skill_id` as `pivot_skill_id`, `user_skills`.`status` as `pivot_status` from `skills` inner join `user_skills` on `skills`.`id` = `user_skills`.`skill_id` where `user_skills`.`user_id` = 4
---
    public function __invoke()
    {
        return response()->json(Crypto::encrypt(Auth::user()->skills->load('character')),200);

select count(*) as aggregate from `user_skills` where (`user_id` = 4 and `status` = 1) and `user_skills`.`deleted_at` is null
update `user_skills` set `status` = 1 where `user_id` = 4 and `skill_id` in (2)
---
    public function useSkill(Request $request)
    {
        $validate = Validator::make($request->all(),[
            'id' => 'required|numeric|exists:skills,id'
        ]);
        if($validate->fails())
        {
            return response()->json(Crypto::encrypt([
                'code' => 500,
                'status' => 'error',
                'message' => 'Kĩ năng không tồn tại'
            ]),200);
        }
        else
        {
            $recentSkills = UserSkill::where([['user_id',Auth::id()],['status',1]]);
            if($recentSkills->count() < $this->maxSkill)
            {
                $levelRequired = Skill::findOrFail($request->id)->required_level;
                if(Auth::user()->level() >= $levelRequired)
                {
                    Auth::user()->skills()->updateExistingPivot($request->id,[
                        'status' => 1
                    ],false);