app/Http/Controllers/Api/IndexController.php

select * from `cate_gears`
select * from `characters` where `id` != '0'
---
    public function initialApplication()
    {
        $cateGears = RedisCache::rememberForever('cateGears', function () {
            return CateGear::all();
        });
        $characters = RedisCache::rememberForever('characters', function () {
            return Character::where('id', '!=', env('NO_CHARACTER_ID'))->get();

select * from `users` where (`id` = 4 or `provider_id` = 4 or `name` LIKE '%4%') and `users`.`deleted_at` is null limit 1
---
    public function userInfor($param)
    {
        $param = $param == 'profile' && Auth::check() ? Auth::id() : $param;
        $findUser = User::whereId($param)
            ->orWhere('id', $param)
            ->orWhere('provider_id', $param)
            ->orWhere('name', 'LIKE', "%$param%")
            ->first();