app/Model/User.php

select * from `characters` where `characters`.`id` in (3)
---
    public function usingSkills()
    {
        $data = [];
        foreach($this->skills as $key => $skill)
        {
            if($skill->pivot->status == 1)
            {
                $data[] = $skill->load('character');

select * from `cate_gears` where `cate_gears`.`id` in (2)
select * from `characters` where `characters`.`id` in (3)
select `gears`.*, `user_gears`.`user_id` as `pivot_user_id`, `user_gears`.`gear_id` as `pivot_gear_id`, `user_gears`.`status` as `pivot_status`, `user_gears`.`id` as `pivot_id`, `user_gears`.`deleted_at` as `pivot_deleted_at` from `gears` inner join `user_gears` on `gears`.`id` = `user_gears`.`gear_id` where `user_gears`.`user_id` = 4
select `gears`.*, `user_gears`.`user_id` as `pivot_user_id`, `user_gears`.`gear_id` as `pivot_gear_id`, `user_gears`.`status` as `pivot_status`, `user_gears`.`id` as `pivot_id` from `gears` inner join `user_gears` on `gears`.`id` = `user_gears`.`gear_id` where `user_gears`.`user_id` = 4 and `user_gears`.`status` = 1
select * from `user_gems` where `user_gems`.`id` in (14, 15, 16) and `user_gems`.`deleted_at` is null
select * from `gems` where `gems`.`id` in (1)
---
    public function usingGears()
    {
        return RedisCache::rememberForever("user.{$this->id}.using-gears", function () {
            $data = [];
            $gears = $this->gears()->wherePivot('status', 1)->get();
            foreach ($gears as $key => $gear) {
                $gear->gems->load(['gems', 'gemItem']);
                $data[] = $gear->load(['character', 'cates']);
            }
            return array_reverse($data);
        });