app/Http/Controllers/Api/Shop/IndexController.php

select * from `cate_gears`
select * from `characters` where `id` != 0
select * from `gears` where `gears`.`character_id` in (2, 3, 4, 5, 6)
select * from `cate_gears` where `cate_gears`.`id` in (4)
select * from `characters` where `characters`.`id` in (2)
select * from `gears` where (`status` = 1 and `cate_gear_id` = 4 and `character_id` = 2)
---
    public function equipment($cate) {
        $equips = RedisCache::rememberForever("shop.$cate", function () use ($cate) {
            $allCates = CateGear::all();
            $characterGears = [];
            foreach($allCates as $cates)
            {
                if($cate == Str::slug($cates->name))
                {
                    $gears = Character::with('gears')->where('id','!=',0)->get();
                    foreach($gears as $i => $gear)
                    {
                        $characterGears[$gear->avatar] = Gear::with('character', 'cates')->where([['status', 1],['cate_gear_id', $cates->id],['character_id', $gear->id]])->get();