app/Income/Helper.php

update `users` set `full_power` = 25921.325, `users`.`updated_at` = '2020-10-05 16:48:53' where `id` = 4
---
    public function updateFullPower()
    {
        $user = $this->user();
        $user->full_power = $this->fullPower($user->id);
        $user->save();

select * from `levels`
---
    public function level()
    {
        $allLevel = Level::all();

select * from `levels` where `level` = 47 limit 1
select * from `levels` where `id` > 48 limit 1
---
    public function nextLevel()
    {
        $currentLevel = Level::whereLevel($this->level())->first();
        $nextLevel = Level::where('id', '>', $currentLevel->id)->first();