app/Http/Controllers/Controller.php

    public function checkTracking()
    {
        return Tracking::whereUserId(Auth::id())->first() ? true : false;
---
select * from `trackings` where `user_id` = 4 limit 1